# Atividade:
    - Importe o arquivo alunos.csv e armazene seu conteúdo  em um DataFrame pandas.
    - Visualize as primeiras 7 linhas do DataFrame e as 5 últimas
    - Confira a quantidade linhas e colunas desse DataFrame
    - Explore as colunas do DataFrame e analise  os tipos dos dados presentes em cada coluna.

### 1 °

In [46]:
import pandas
import random

loc = "Dataset/alunos.csv"

data = pandas.read_csv(loc)

### 2 °

In [45]:
data.head(7)
# data.head(random.randrange(1, 18))

    Nome  Idade  Notas  Aprovado
0    Ary     20    7.5      True
1    Ana     18    NaN     False
2  Cátia     27    2.5     False
3  Denis     18    5.0     False
4   Beto     21   10.0      True
5  Bruna     23    NaN     False
6   Dara     21    7.0      True

In [49]:
data.tail(5)

      Nome  Idade  Notas  Aprovado
13   Mirla     25    9.0      True
14   Paulo     37    NaN     False
15  Mylena     29    7.0      True
16   Lucas     33    NaN     False
17   Nadia     34    8.0      True

### 3 °

In [56]:
data.shape

(18, 4)

### 4 °

In [50]:
data[["Nome", "Notas"]]

         Nome  Notas
0         Ary    7.5
1         Ana    NaN
2       Cátia    2.5
3       Denis    5.0
4        Beto   10.0
5       Bruna    NaN
6        Dara    7.0
7      Carlos    6.0
8       Alice    5.6
9       Vitor    NaN
10     Daniel    NaN
11       Igor    4.5
12  Sthefanie    9.5
13      Mirla    9.0
14      Paulo    NaN
15     Mylena    7.0
16      Lucas    NaN
17      Nadia    8.0

## Testes

In [63]:
i = 0
i = int(i)
for i in data.take([i]):
    i = 1 + i

    if data.take([i]) == data.isnull:
        i = 1 + 1
    else:
        continue

"""data.take([5, 6, 7, 8])
data.isnull"""

TypeError: unsupported operand type(s) for +: 'int' and 'str'